
//------------ file dict_func.h  -----------------------

//-----  начален размер на динамичните масиви ----
#define SIZE_DICT 1000
// стъпка на увеличаване на динамичните масиви -----
#define DELTA_SIZE 500

 // ---- разпознаване на разделители ---------
int IsDelimiter(char *delimiters, char c);
                // --- char *delimiters - масив от символи, дефинирани като разделители, завърюващ с терминиращ символ NULL;
                // --- char c - текущ символ, които се тества; 


// ---- потоково отделяне на дума ---- 
void ComputeWord(int c, char *word, int *ind, int *status);
                 // --- (int c        - текущ символ;
                 // ---  int *br_word - текущ брой на думите;
                 // ---  char *word   - символен масив за отделянер на дума;
                 // ---  int *status  - текущ статус на автоматния модел;
void ComputeCode(int c, char *digit, int *ind, int *status);
//----------------------------------------------------------------------------------
//---- освобождава заделената памет за всяка отделена дума в речника, след което
//---- освобождава паметта за динамичния масив, съхраняващ адресите на думите
void DeleteDictionary(char **dict, int *count_words, int index_dict);
//----------------------------------------------------------------------------------

// --- извежда речника на екрана --- 
void PrintDictionary(char **dict, int index_dict, int *count_words,int status);
//----------------------------------------------------------------------------------

// --- търси думата в речника - връща индекса й при намиране, или -1
int FindInToDictionary(char **dict, int index_dict, char *word);
//----------------------------------------------------------------------------------

// --- добавя дума в речника, като връща началото на динамичния масив с добавената дума ---
char ** AddToDictionary(char **dict, int *size_dict, int *index, int **count_words, char *word);
//----------------------------------------------------------------------------------

char ** MakeDictionary(FILE *fp, char **dict, int *size_dict, int *index, int **count_words, int *status);

// --- сортиране на речника --------------------------------------------------------
void SortDict(char **dict, int index, int *count_words, int mode);
//----------------------------------------------------------------------------------

//---  сортиране на речника --------------------------------------------------------
void SaveDictionary(char **dict, int index, int *count_words, char *name_file, char *name_dict, int mode, int mode2);
//----------------------------------------------------------------------------------
char ** ReadDictionary(FILE *fp, char **dict, int *size_dict, int *index, int **count_words, int *status);

// --- записване и кодиране на речника --------------------------------------------- 
void SaveCodeFile(FILE *fp_in, char **dict, int index, char *name_file, char *name_dict, int mode);
//----------------------------------------------------------------------------------

// --- директно четене на символ от клавиатурата до EOF ---------------------------- 
int my_fgetc(FILE *fp);
//----------------------------------------------------------------------------------
void cyr_lat_toupperCP1251(unsigned char *line);
//----------------------------------------------------------------------------------
void cyr_lat_tolowerCP1251(unsigned char *line);
//----------------------------------------------------------------------------------
